LDB_techs_name = {
    '戴森球计划': 1,
    '电磁学': 1001,
    '电磁矩阵': 1002,
    '高效电浆控制': 1101,
    '等离子萃取精炼': 1102,
    'X射线裂解': 1103,
    '重整精炼': 1104,
    '能量矩阵': 1111,
    '氢燃料棒': 1112,
    '推进器': 1113,
    '加力推进器': 1114,
    '流体储存封装': 1120,
    '基础化工': 1121,
    '高分子化工': 1122,
    '高强度晶体': 1123,
    '结构矩阵': 1124,
    '卡西米尔晶体': 1125,
    '高强度玻璃': 1126,
    '应用型超导体': 1131,
    '高强度材料': 1132,
    '粒子可控': 1133,
    '重氢分馏': 1134,
    '波函数干扰': 1141,
    '微型粒子对撞机': 1142,
    '奇异物质': 1143,
    '人造恒星': 1144,
    '可控湮灭反应': 1145,
    '增产剂 Mk.I': 1151,
    '增产剂 Mk.II': 1152,
    '增产剂 Mk.III': 1153,
    '基础制造': 1201,
    '高速制造': 1202,
    '量子打印': 1203,
    '处理器': 1302,
    '量子芯片': 1303,
    '光子聚束采矿': 1304,
    '亚微观量子纠缠': 1305,
    '半导体材料': 1311,
    '信息矩阵': 1312,
    '自动化冶金': 1401,
    '冶炼提纯': 1402,
    '晶体冶炼': 1403,
    '钢材冶炼': 1411,
    '火力发电': 1412,
    '钛矿冶炼': 1413,
    '高强度钛合金': 1414,
    '移山填海工程': 1415,
    '微型核聚变发电': 1416,
    '位面冶金': 1417,
    '太阳能收集': 1501,
    '光子变频': 1502,
    '太阳帆轨道系统': 1503,
    '射线接收站': 1504,
    '行星电离层利用': 1505,
    '狄拉克逆变机制': 1506,
    '宇宙矩阵': 1507,
    '任务完成 !': 1508,
    '能量储存': 1511,
    '星际电力运输': 1512,
    '地热开采': 1513,
    '高强度轻质结构': 1521,
    '垂直发射井': 1522,
    '戴森球应力系统': 1523,
    '基础物流系统': 1601,
    '改良物流系统': 1602,
    '高效物流系统': 1603,
    '行星物流系统': 1604,
    '星际物流系统': 1605,
    '气态行星开采': 1606,
    '集装物流系统': 1607,
    '配送物流系统': 1608,
    '电磁驱动': 1701,
    '磁悬浮': 1702,
    '粒子磁力阱': 1703,
    '引力波折射': 1704,
    '引力矩阵': 1705,
    '超级磁场发生器': 1711,
    '卫星配电系统': 1712,
    '武器系统': 1801,
    '燃烧单元': 1802,
    '爆破单元': 1803,
    '晶石爆破单元': 1804,
    '动力引擎': 1805,
    '导弹防御塔': 1806,
    '聚爆加农炮': 1807,
    '信号塔': 1808,
    '行星防御系统': 1809,
    '干扰塔': 1810,
    '磁化电浆炮': 1811,
    '钛化弹箱': 1812,
    '超合金弹箱': 1813,
    '高爆炮弹组': 1814,
    '超音速导弹组': 1815,
    '晶石炮弹组': 1816,
    '引力导弹组': 1817,
    '反物质胶囊': 1818,
    '原型机': 1819,
    '精准无人机': 1820,
    '攻击无人机': 1821,
    '护卫舰': 1822,
    '驱逐舰': 1823,
    '压制胶囊': 1824,
    '战场分析基站': 1826,
    '数字模拟计算': 1901,
    '物质重组': 1902,
    '负熵递归': 1903,
    '高密度可控湮灭': 1904,
    '机甲核心': 2101,
    '机甲核心': 2102,
    '机甲核心': 2103,
    '机甲核心': 2104,
    '机甲核心': 2105,
    '机甲核心': 2106,
    '机械骨骼': 2201,
    '机械骨骼': 2202,
    '机械骨骼': 2203,
    '机械骨骼': 2204,
    '机械骨骼': 2205,
    '机械骨骼': 2206,
    '机械骨骼': 2207,
    '机械骨骼': 2208,
    '机舱容量': 2301,
    '机舱容量': 2302,
    '机舱容量': 2303,
    '机舱容量': 2304,
    '机舱容量': 2305,
    '机舱容量': 2306,
    '机舱容量': 2307,
    '通讯控制': 2401,
    '通讯控制': 2402,
    '通讯控制': 2403,
    '通讯控制': 2404,
    '通讯控制': 2405,
    '通讯控制': 2406,
    '通讯控制': 2407,
    '能量回路': 2501,
    '能量回路': 2502,
    '能量回路': 2503,
    '能量回路': 2504,
    '能量回路': 2505,
    '能量回路': 2506,
    '无人机引擎': 2601,
    '无人机引擎': 2602,
    '无人机引擎': 2603,
    '无人机引擎': 2604,
    '无人机引擎': 2605,
    '无人机引擎': 2606,
    '批量建造': 2701,
    '批量建造': 2702,
    '批量建造': 2703,
    '批量建造': 2704,
    '批量建造': 2705,
    '能量护盾': 2801,
    '能量护盾': 2802,
    '能量护盾': 2803,
    '能量护盾': 2804,
    '能量护盾': 2805,
    '能量护盾': 2806,
    '能量护盾': 2807,
    '驱动引擎': 2901,
    '驱动引擎': 2902,
    '驱动引擎': 2903,
    '驱动引擎': 2904,
    '驱动引擎': 2905,
    '驱动引擎': 2906,
    '自动标记重建': 2951,
    '自动标记重建': 2952,
    '自动标记重建': 2953,
    '自动标记重建': 2954,
    '自动标记重建': 2955,
    '自动标记重建': 2956,
    '太阳帆寿命': 3101,
    '太阳帆寿命': 3102,
    '太阳帆寿命': 3103,
    '太阳帆寿命': 3104,
    '太阳帆寿命': 3105,
    '太阳帆寿命': 3106,
    '射线传输效率': 3201,
    '射线传输效率': 3202,
    '射线传输效率': 3203,
    '射线传输效率': 3204,
    '射线传输效率': 3205,
    '射线传输效率': 3206,
    '射线传输效率': 3207,
    '射线传输效率': 3208,
    '分拣器货物叠加': 3301,
    '分拣器货物叠加': 3302,
    '分拣器货物叠加': 3303,
    '分拣器货物叠加': 3304,
    '分拣器货物叠加': 3305,
    '分拣器货物集装': 3306,
    '集装分拣器改良': 3311,
    '集装分拣器改良': 3312,
    '集装分拣器改良': 3313,
    '集装分拣器改良': 3314,
    '集装分拣器改良': 3315,
    '集装分拣器改良': 3316,
    '配送范围': 4001,
    '配送范围': 4002,
    '配送范围': 4003,
    '配送范围': 4004,
    '配送范围': 4005,
    '运输船引擎': 3401,
    '运输船引擎': 3402,
    '运输船引擎': 3403,
    '运输船引擎': 3404,
    '运输船引擎': 3405,
    '运输船引擎': 3406,
    '运输船引擎': 3407,
    '运输机舱扩容': 3501,
    '运输机舱扩容': 3502,
    '运输机舱扩容': 3503,
    '运输机舱扩容': 3504,
    '运输机舱扩容': 3505,
    '运输机舱扩容': 3506,
    '运输机舱扩容': 3507,
    '运输机舱扩容': 3508,
    '运输机舱扩容': 3509,
    '运输机舱扩容': 3510,
    '运输站集装物流': 3801,
    '运输站集装物流': 3802,
    '运输站集装物流': 3803,
    '矿物利用': 3601,
    '矿物利用': 3602,
    '矿物利用': 3603,
    '矿物利用': 3604,
    '矿物利用': 3605,
    '矿物利用': 3606,
    '垂直建造': 3701,
    '垂直建造': 3702,
    '垂直建造': 3703,
    '垂直建造': 3704,
    '垂直建造': 3705,
    '垂直建造': 3706,
    '研究速度': 3901,
    '研究速度': 3902,
    '研究速度': 3903,
    '研究速度': 3904,
    '宇宙探索': 4101,
    '宇宙探索': 4102,
    '宇宙探索': 4103,
    '宇宙探索': 4104,
    '动能武器伤害': 5001,
    '动能武器伤害': 5002,
    '动能武器伤害': 5003,
    '动能武器伤害': 5004,
    '动能武器伤害': 5005,
    '动能武器伤害': 5006,
    '能量武器伤害': 5101,
    '能量武器伤害': 5102,
    '能量武器伤害': 5103,
    '能量武器伤害': 5104,
    '能量武器伤害': 5105,
    '能量武器伤害': 5106,
    '爆破武器伤害': 5201,
    '爆破武器伤害': 5202,
    '爆破武器伤害': 5203,
    '爆破武器伤害': 5204,
    '爆破武器伤害': 5205,
    '爆破武器伤害': 5206,
    '战斗无人机伤害': 5301,
    '战斗无人机伤害': 5302,
    '战斗无人机伤害': 5303,
    '战斗无人机伤害': 5304,
    '战斗无人机伤害': 5305,
    '战斗无人机射速': 5401,
    '战斗无人机射速': 5402,
    '战斗无人机射速': 5403,
    '战斗无人机射速': 5404,
    '战斗无人机射速': 5405,
    '战斗无人机耐久': 5601,
    '战斗无人机耐久': 5602,
    '战斗无人机耐久': 5603,
    '战斗无人机耐久': 5604,
    '战斗无人机耐久': 5605,
    '行星护盾': 5701,
    '行星护盾': 5702,
    '行星护盾': 5703,
    '行星护盾': 5704,
    '行星护盾': 5705,
    '地面编队扩容': 5801,
    '地面编队扩容': 5802,
    '地面编队扩容': 5803,
    '地面编队扩容': 5804,
    '地面编队扩容': 5805,
    '地面编队扩容': 5806,
    '地面编队扩容': 5807,
    '太空编队扩容': 5901,
    '太空编队扩容': 5902,
    '太空编队扩容': 5903,
    '太空编队扩容': 5904,
    '太空编队扩容': 5905,
    '太空编队扩容': 5906,
    '太空编队扩容': 5907,
    '结构强化': 6001,
    '结构强化': 6002,
    '结构强化': 6003,
    '结构强化': 6004,
    '结构强化': 6005,
    '结构强化': 6006,
    '电磁武器效果': 6101,
    '电磁武器效果': 6102,
    '电磁武器效果': 6103,
    '电磁武器效果': 6104,
    '电磁武器效果': 6105,
    '电磁武器效果': 6106,
}
LDB_techs_id = {
    1:'戴森球计划',
    1001:'电磁学',
    1002:'电磁矩阵',
    1101:'高效电浆控制',
    1102:'等离子萃取精炼',
    1103:'X射线裂解',
    1104:'重整精炼',
    1111:'能量矩阵',
    1112:'氢燃料棒',
    1113:'推进器',
    1114:'加力推进器',
    1120:'流体储存封装',
    1121:'基础化工',
    1122:'高分子化工',
    1123:'高强度晶体',
    1124:'结构矩阵',
    1125:'卡西米尔晶体',
    1126:'高强度玻璃',
    1131:'应用型超导体',
    1132:'高强度材料',
    1133:'粒子可控',
    1134:'重氢分馏',
    1141:'波函数干扰',
    1142:'微型粒子对撞机',
    1143:'奇异物质',
    1144:'人造恒星',
    1145:'可控湮灭反应',
    1151:'增产剂 Mk.I',
    1152:'增产剂 Mk.II',
    1153:'增产剂 Mk.III',
    1201:'基础制造',
    1202:'高速制造',
    1203:'量子打印',
    1302:'处理器',
    1303:'量子芯片',
    1304:'光子聚束采矿',
    1305:'亚微观量子纠缠',
    1311:'半导体材料',
    1312:'信息矩阵',
    1401:'自动化冶金',
    1402:'冶炼提纯',
    1403:'晶体冶炼',
    1411:'钢材冶炼',
    1412:'火力发电',
    1413:'钛矿冶炼',
    1414:'高强度钛合金',
    1415:'移山填海工程',
    1416:'微型核聚变发电',
    1417:'位面冶金',
    1501:'太阳能收集',
    1502:'光子变频',
    1503:'太阳帆轨道系统',
    1504:'射线接收站',
    1505:'行星电离层利用',
    1506:'狄拉克逆变机制',
    1507:'宇宙矩阵',
    1508:'任务完成 !',
    1511:'能量储存',
    1512:'星际电力运输',
    1513:'地热开采',
    1521:'高强度轻质结构',
    1522:'垂直发射井',
    1523:'戴森球应力系统',
    1601:'基础物流系统',
    1602:'改良物流系统',
    1603:'高效物流系统',
    1604:'行星物流系统',
    1605:'星际物流系统',
    1606:'气态行星开采',
    1607:'集装物流系统',
    1608:'配送物流系统',
    1701:'电磁驱动',
    1702:'磁悬浮',
    1703:'粒子磁力阱',
    1704:'引力波折射',
    1705:'引力矩阵',
    1711:'超级磁场发生器',
    1712:'卫星配电系统',
    1801:'武器系统',
    1802:'燃烧单元',
    1803:'爆破单元',
    1804:'晶石爆破单元',
    1805:'动力引擎',
    1806:'导弹防御塔',
    1807:'聚爆加农炮',
    1808:'信号塔',
    1809:'行星防御系统',
    1810:'干扰塔',
    1811:'磁化电浆炮',
    1812:'钛化弹箱',
    1813:'超合金弹箱',
    1814:'高爆炮弹组',
    1815:'超音速导弹组',
    1816:'晶石炮弹组',
    1817:'引力导弹组',
    1818:'反物质胶囊',
    1819:'原型机',
    1820:'精准无人机',
    1821:'攻击无人机',
    1822:'护卫舰',
    1823:'驱逐舰',
    1824:'压制胶囊',
    1826:'战场分析基站',
    1901:'数字模拟计算',
    1902:'物质重组',
    1903:'负熵递归',
    1904:'高密度可控湮灭',
    2101:'机甲核心',
    2102:'机甲核心',
    2103:'机甲核心',
    2104:'机甲核心',
    2105:'机甲核心',
    2106:'机甲核心',
    2201:'机械骨骼',
    2202:'机械骨骼',
    2203:'机械骨骼',
    2204:'机械骨骼',
    2205:'机械骨骼',
    2206:'机械骨骼',
    2207:'机械骨骼',
    2208:'机械骨骼',
    2301:'机舱容量',
    2302:'机舱容量',
    2303:'机舱容量',
    2304:'机舱容量',
    2305:'机舱容量',
    2306:'机舱容量',
    2307:'机舱容量',
    2401:'通讯控制',
    2402:'通讯控制',
    2403:'通讯控制',
    2404:'通讯控制',
    2405:'通讯控制',
    2406:'通讯控制',
    2407:'通讯控制',
    2501:'能量回路',
    2502:'能量回路',
    2503:'能量回路',
    2504:'能量回路',
    2505:'能量回路',
    2506:'能量回路',
    2601:'无人机引擎',
    2602:'无人机引擎',
    2603:'无人机引擎',
    2604:'无人机引擎',
    2605:'无人机引擎',
    2606:'无人机引擎',
    2701:'批量建造',
    2702:'批量建造',
    2703:'批量建造',
    2704:'批量建造',
    2705:'批量建造',
    2801:'能量护盾',
    2802:'能量护盾',
    2803:'能量护盾',
    2804:'能量护盾',
    2805:'能量护盾',
    2806:'能量护盾',
    2807:'能量护盾',
    2901:'驱动引擎',
    2902:'驱动引擎',
    2903:'驱动引擎',
    2904:'驱动引擎',
    2905:'驱动引擎',
    2906:'驱动引擎',
    2951:'自动标记重建',
    2952:'自动标记重建',
    2953:'自动标记重建',
    2954:'自动标记重建',
    2955:'自动标记重建',
    2956:'自动标记重建',
    3101:'太阳帆寿命',
    3102:'太阳帆寿命',
    3103:'太阳帆寿命',
    3104:'太阳帆寿命',
    3105:'太阳帆寿命',
    3106:'太阳帆寿命',
    3201:'射线传输效率',
    3202:'射线传输效率',
    3203:'射线传输效率',
    3204:'射线传输效率',
    3205:'射线传输效率',
    3206:'射线传输效率',
    3207:'射线传输效率',
    3208:'射线传输效率',
    3301:'分拣器货物叠加',
    3302:'分拣器货物叠加',
    3303:'分拣器货物叠加',
    3304:'分拣器货物叠加',
    3305:'分拣器货物叠加',
    3306:'分拣器货物集装',
    3311:'集装分拣器改良',
    3312:'集装分拣器改良',
    3313:'集装分拣器改良',
    3314:'集装分拣器改良',
    3315:'集装分拣器改良',
    3316:'集装分拣器改良',
    4001:'配送范围',
    4002:'配送范围',
    4003:'配送范围',
    4004:'配送范围',
    4005:'配送范围',
    3401:'运输船引擎',
    3402:'运输船引擎',
    3403:'运输船引擎',
    3404:'运输船引擎',
    3405:'运输船引擎',
    3406:'运输船引擎',
    3407:'运输船引擎',
    3501:'运输机舱扩容',
    3502:'运输机舱扩容',
    3503:'运输机舱扩容',
    3504:'运输机舱扩容',
    3505:'运输机舱扩容',
    3506:'运输机舱扩容',
    3507:'运输机舱扩容',
    3508:'运输机舱扩容',
    3509:'运输机舱扩容',
    3510:'运输机舱扩容',
    3801:'运输站集装物流',
    3802:'运输站集装物流',
    3803:'运输站集装物流',
    3601:'矿物利用',
    3602:'矿物利用',
    3603:'矿物利用',
    3604:'矿物利用',
    3605:'矿物利用',
    3606:'矿物利用',
    3701:'垂直建造',
    3702:'垂直建造',
    3703:'垂直建造',
    3704:'垂直建造',
    3705:'垂直建造',
    3706:'垂直建造',
    3901:'研究速度',
    3902:'研究速度',
    3903:'研究速度',
    3904:'研究速度',
    4101:'宇宙探索',
    4102:'宇宙探索',
    4103:'宇宙探索',
    4104:'宇宙探索',
    5001:'动能武器伤害',
    5002:'动能武器伤害',
    5003:'动能武器伤害',
    5004:'动能武器伤害',
    5005:'动能武器伤害',
    5006:'动能武器伤害',
    5101:'能量武器伤害',
    5102:'能量武器伤害',
    5103:'能量武器伤害',
    5104:'能量武器伤害',
    5105:'能量武器伤害',
    5106:'能量武器伤害',
    5201:'爆破武器伤害',
    5202:'爆破武器伤害',
    5203:'爆破武器伤害',
    5204:'爆破武器伤害',
    5205:'爆破武器伤害',
    5206:'爆破武器伤害',
    5301:'战斗无人机伤害',
    5302:'战斗无人机伤害',
    5303:'战斗无人机伤害',
    5304:'战斗无人机伤害',
    5305:'战斗无人机伤害',
    5401:'战斗无人机射速',
    5402:'战斗无人机射速',
    5403:'战斗无人机射速',
    5404:'战斗无人机射速',
    5405:'战斗无人机射速',
    5601:'战斗无人机耐久',
    5602:'战斗无人机耐久',
    5603:'战斗无人机耐久',
    5604:'战斗无人机耐久',
    5605:'战斗无人机耐久',
    5701:'行星护盾',
    5702:'行星护盾',
    5703:'行星护盾',
    5704:'行星护盾',
    5705:'行星护盾',
    5801:'地面编队扩容',
    5802:'地面编队扩容',
    5803:'地面编队扩容',
    5804:'地面编队扩容',
    5805:'地面编队扩容',
    5806:'地面编队扩容',
    5807:'地面编队扩容',
    5901:'太空编队扩容',
    5902:'太空编队扩容',
    5903:'太空编队扩容',
    5904:'太空编队扩容',
    5905:'太空编队扩容',
    5906:'太空编队扩容',
    5907:'太空编队扩容',
    6001:'结构强化',
    6002:'结构强化',
    6003:'结构强化',
    6004:'结构强化',
    6005:'结构强化',
    6006:'结构强化',
    6101:'电磁武器效果',
    6102:'电磁武器效果',
    6103:'电磁武器效果',
    6104:'电磁武器效果',
    6105:'电磁武器效果',
    6106:'电磁武器效果',
}
1 戴森球计划
1001 电磁学
1002 电磁矩阵
1101 高效电浆控制
1102 等离子萃取精炼
1103 X射线裂解
1104 重整精炼
1111 能量矩阵
1112 氢燃料棒
1113 推进器
1114 加力推进器
1120 流体储存封装
1121 基础化工
1122 高分子化工
1123 高强度晶体
1124 结构矩阵
1125 卡西米尔晶体
1126 高强度玻璃
1131 应用型超导体
1132 高强度材料
1133 粒子可控
1134 重氢分馏
1141 波函数干扰
1142 微型粒子对撞机
1143 奇异物质
1144 人造恒星
1145 可控湮灭反应
1151 增产剂 Mk.I
1152 增产剂 Mk.II
1153 增产剂 Mk.III
1201 基础制造
1202 高速制造
1203 量子打印
1302 处理器
1303 量子芯片
1304 光子聚束采矿
1305 亚微观量子纠缠
1311 半导体材料
1312 信息矩阵
1401 自动化冶金
1402 冶炼提纯
1403 晶体冶炼
1411 钢材冶炼
1412 火力发电
1413 钛矿冶炼
1414 高强度钛合金
1415 移山填海工程
1416 微型核聚变发电
1417 位面冶金
1501 太阳能收集
1502 光子变频
1503 太阳帆轨道系统
1504 射线接收站
1505 行星电离层利用
1506 狄拉克逆变机制
1507 宇宙矩阵
1508 任务完成 !
1511 能量储存
1512 星际电力运输
1513 地热开采
1521 高强度轻质结构
1522 垂直发射井
1523 戴森球应力系统
1601 基础物流系统
1602 改良物流系统
1603 高效物流系统
1604 行星物流系统
1605 星际物流系统
1606 气态行星开采
1607 集装物流系统
1608 配送物流系统
1701 电磁驱动
1702 磁悬浮
1703 粒子磁力阱
1704 引力波折射
1705 引力矩阵
1711 超级磁场发生器
1712 卫星配电系统
1801 武器系统
1802 燃烧单元
1803 爆破单元
1804 晶石爆破单元
1805 动力引擎
1806 导弹防御塔
1807 聚爆加农炮
1808 信号塔
1809 行星防御系统
1810 干扰塔
1811 磁化电浆炮
1812 钛化弹箱
1813 超合金弹箱
1814 高爆炮弹组
1815 超音速导弹组
1816 晶石炮弹组
1817 引力导弹组
1818 反物质胶囊
1819 原型机
1820 精准无人机
1821 攻击无人机
1822 护卫舰
1823 驱逐舰
1824 压制胶囊
1826 战场分析基站
1901 数字模拟计算
1902 物质重组
1903 负熵递归
1904 高密度可控湮灭
2101 机甲核心
2102 机甲核心
2103 机甲核心
2104 机甲核心
2105 机甲核心
2106 机甲核心
2201 机械骨骼
2202 机械骨骼
2203 机械骨骼
2204 机械骨骼
2205 机械骨骼
2206 机械骨骼
2207 机械骨骼
2208 机械骨骼
2301 机舱容量
2302 机舱容量
2303 机舱容量
2304 机舱容量
2305 机舱容量
2306 机舱容量
2307 机舱容量
2401 通讯控制
2402 通讯控制
2403 通讯控制
2404 通讯控制
2405 通讯控制
2406 通讯控制
2407 通讯控制
2501 能量回路
2502 能量回路
2503 能量回路
2504 能量回路
2505 能量回路
2506 能量回路
2601 无人机引擎
2602 无人机引擎
2603 无人机引擎
2604 无人机引擎
2605 无人机引擎
2606 无人机引擎
2701 批量建造
2702 批量建造
2703 批量建造
2704 批量建造
2705 批量建造
2801 能量护盾
2802 能量护盾
2803 能量护盾
2804 能量护盾
2805 能量护盾
2806 能量护盾
2807 能量护盾
2901 驱动引擎
2902 驱动引擎
2903 驱动引擎
2904 驱动引擎
2905 驱动引擎
2906 驱动引擎
2951 自动标记重建
2952 自动标记重建
2953 自动标记重建
2954 自动标记重建
2955 自动标记重建
2956 自动标记重建
3101 太阳帆寿命
3102 太阳帆寿命
3103 太阳帆寿命
3104 太阳帆寿命
3105 太阳帆寿命
3106 太阳帆寿命
3201 射线传输效率
3202 射线传输效率
3203 射线传输效率
3204 射线传输效率
3205 射线传输效率
3206 射线传输效率
3207 射线传输效率
3208 射线传输效率
3301 分拣器货物叠加
3302 分拣器货物叠加
3303 分拣器货物叠加
3304 分拣器货物叠加
3305 分拣器货物叠加
3306 分拣器货物集装
3311 集装分拣器改良
3312 集装分拣器改良
3313 集装分拣器改良
3314 集装分拣器改良
3315 集装分拣器改良
3316 集装分拣器改良
4001 配送范围
4002 配送范围
4003 配送范围
4004 配送范围
4005 配送范围
3401 运输船引擎
3402 运输船引擎
3403 运输船引擎
3404 运输船引擎
3405 运输船引擎
3406 运输船引擎
3407 运输船引擎
3501 运输机舱扩容
3502 运输机舱扩容
3503 运输机舱扩容
3504 运输机舱扩容
3505 运输机舱扩容
3506 运输机舱扩容
3507 运输机舱扩容
3508 运输机舱扩容
3509 运输机舱扩容
3510 运输机舱扩容
3801 运输站集装物流
3802 运输站集装物流
3803 运输站集装物流
3601 矿物利用
3602 矿物利用
3603 矿物利用
3604 矿物利用
3605 矿物利用
3606 矿物利用
3701 垂直建造
3702 垂直建造
3703 垂直建造
3704 垂直建造
3705 垂直建造
3706 垂直建造
3901 研究速度
3902 研究速度
3903 研究速度
3904 研究速度
4101 宇宙探索
4102 宇宙探索
4103 宇宙探索
4104 宇宙探索
5001 动能武器伤害
5002 动能武器伤害
5003 动能武器伤害
5004 动能武器伤害
5005 动能武器伤害
5006 动能武器伤害
5101 能量武器伤害
5102 能量武器伤害
5103 能量武器伤害
5104 能量武器伤害
5105 能量武器伤害
5106 能量武器伤害
5201 爆破武器伤害
5202 爆破武器伤害
5203 爆破武器伤害
5204 爆破武器伤害
5205 爆破武器伤害
5206 爆破武器伤害
5301 战斗无人机伤害
5302 战斗无人机伤害
5303 战斗无人机伤害
5304 战斗无人机伤害
5305 战斗无人机伤害
5401 战斗无人机射速
5402 战斗无人机射速
5403 战斗无人机射速
5404 战斗无人机射速
5405 战斗无人机射速
5601 战斗无人机耐久
5602 战斗无人机耐久
5603 战斗无人机耐久
5604 战斗无人机耐久
5605 战斗无人机耐久
5701 行星护盾
5702 行星护盾
5703 行星护盾
5704 行星护盾
5705 行星护盾
5801 地面编队扩容
5802 地面编队扩容
5803 地面编队扩容
5804 地面编队扩容
5805 地面编队扩容
5806 地面编队扩容
5807 地面编队扩容
5901 太空编队扩容
5902 太空编队扩容
5903 太空编队扩容
5904 太空编队扩容
5905 太空编队扩容
5906 太空编队扩容
5907 太空编队扩容
6001 结构强化
6002 结构强化
6003 结构强化
6004 结构强化
6005 结构强化
6006 结构强化
6101 电磁武器效果
6102 电磁武器效果
6103 电磁武器效果
6104 电磁武器效果
6105 电磁武器效果
6106 电磁武器效果
